Revit 2026 API

# RepeaterBounds Properties

---

The RepeaterBounds type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionCount | The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RepeaterBounds Class

Autodesk.Revit.DB Namespace